gcc -g p4final.c
îº§ gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x932: file p4final.c, line 48.
(gdb) r
Starting program: /home/runner/Test3Session2-5/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p4final.c:48
48  {
(gdb) n
51    n=input_degree();
(gdb) n
Enter degree of the polynomial
1
52    x=input_x();
(gdb) n
Enter the value of x
1
53    input_coefficients(n,a);
(gdb) n
Enter coefficient's of the polynomial x 
Enter Coefficient of [ X^1 ] 
1
Enter Coefficient of [ X^0 ] 
1
54    result=evaluate_polynomial(n,a,x);
(gdb) n
55    out_put(n,a,x,result);
(gdb) n
Value of the polynomial is = [ 2.000000 ]
56    return 0;
(gdb) s
57  }(gdb) p
The history is empty.
(gdb) c
Continuing.
[Inferior 1 (process 77) exited normally]
(gdb) l
52    x=input_x();
53    input_coefficients(n,a);
54    result=evaluate_polynomial(n,a,x);
55    out_put(n,a,x,result);
56    return 0;
57  }(gdb)
